Тест1/src/Enums/СпособыНачисленияОклада/СпособыНачисленияОклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыНачисленияОклада</name>
  <enumValues>
    <name>ПоЧасам</name>
  </enumValues>
  <enumValues>
    <name>ПоДням</name>
  </enumValues>
</mdclass:Enum>

Тест1/src/Catalogs/дт_ВидыРасчетовЗарплаты/дт_ВидыРасчетовЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>дт_ВидыРасчетовЗарплаты</name>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Премия</name>
      <description>Премия</description>
    </items>
    <items>
      <name>СдельнаяОплата</name>
      <description>Сдельная оплата</description>
    </items>
    <items>
      <name>Неявки</name>
      <description>Неявки</description>
    </items>
    <items>
      <name>Больничный</name>
      <description>Больничный</description>
    </items>
  </predefined>
</mdclass:Catalog>

Тест1/src/CommonModules/дт_ЗарплатаКлиентСервер/Module.bsl
//
//  https://nov-soft.ru
//

#Область ПрограммныйИнтерфейс

Процедура ОбработкаИзмененияСтроки(Объект, ТекДанные, Поле, ПараметрыДолжности, ДопПарам = Неопределено) Экспорт

	//ТекДанные = Элементы[ИмяТабличнойЧасти].ТекущиеДанные;
	
	КоличествоОтработано = ТекДанные.КоличествоОтработано;
	Если ПараметрыДолжности.НормироватьОтработанноеВремя Тогда
		КоличествоОтработано = Мин(КоличествоОтработано, ТекДанные.КоличествоРабочееВремя);	
	КонецЕсли;
	
	// Оклад
	Если ТекДанные.ВидРасчета = ПредопределенноеЗначение("Справочник.дт_ВидыРасчетовЗарплаты.Оклад") Тогда	
		
		Если Поле = "КоличествоОтработано" 
			ИЛИ Поле = "КоличествоРабочееВремя" Тогда
			
			Если ПараметрыДолжности.СпособНачисленияОклада = ПредопределенноеЗначение("Перечисление.СпособыНачисленияОклада.ПоДням") 
				ИЛИ ПараметрыДолжности.СпособНачисленияОклада = ПредопределенноеЗначение("Перечисление.СпособыНачисленияОклада.ПоЧасам") Тогда	
					
				ТекДанные.СуммаНачислено = ?(ТекДанные.КоличествоРабочееВремя = 0, 
					0,
					ТекДанные.СуммаБаза * КоличествоОтработано / ТекДанные.КоличествоРабочееВремя
				);
				 
			КонецЕсли;
			
		КонецЕсли;
	
	// Сделка
	ИначеЕсли ТекДанные.ВидРасчета = ПредопределенноеЗначение("Справочник.дт_ВидыРасчетовЗарплаты.СдельнаяОплата") Тогда
		
		Если ПараметрыДолжности.СпособНачисленияСдельнойОплаты = ПредопределенноеЗначение("Перечисление.СпособыНачисленияСдельнойОплаты.ПоЧасам") Тогда
		
			ТекДанные.СуммаНачислено = ТекДанные.СуммаБаза * ТекДанные.КоличествоОтработано;
				
		КонецЕсли;

	// Административный
	ИначеЕсли ТекДанные.ВидРасчета = ПредопределенноеЗначение("Справочник.дт_ВидыРасчетовЗарплаты.Неявки") Тогда
		
		СуммаСделки = ДопПарам;
		
		ТекДанные.СуммаНачислено = -1 * ?(ТекДанные.КоличествоРабочееВремя = 0, 
			0,
			Мин(ТекДанные.СуммаБаза * КоличествоОтработано / ТекДанные.КоличествоРабочееВремя, СуммаСделки)
		);
				
	// Больничный
	ИначеЕсли ТекДанные.ВидРасчета = ПредопределенноеЗначение("Справочник.дт_ВидыРасчетовЗарплаты.Больничный") Тогда	
		
		Если Поле = "КоличествоОтработано" 
			ИЛИ Поле = "КоличествоРабочееВремя" Тогда
			
			КоэффициентБольничного = 0.5;
					
			ТекДанные.СуммаНачислено = ?(ТекДанные.КоличествоРабочееВремя = 0, 
				0,
				ТекДанные.СуммаБаза * КоличествоОтработано * КоэффициентБольничного / ТекДанные.КоличествоРабочееВремя
			);
				 
			
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры // ОбработкаИзмененияСтроки()


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
